; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph3 - mode
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	thermograph4 - mode
	image6 - mode
	infrared5 - mode
	groundstation0 - direction
	groundstation4 - direction
	groundstation2 - direction
	star3 - direction
	star1 - direction
	phenomenon5 - direction
	phenomenon6 - direction
	phenomenon7 - direction
	planet8 - direction
	phenomenon9 - direction
	phenomenon10 - direction
	planet11 - direction
	planet12 - direction
	planet13 - direction
	phenomenon14 - direction
	phenomenon15 - direction
	phenomenon16 - direction
	phenomenon17 - direction
	planet18 - direction
	phenomenon19 - direction
	phenomenon20 - direction
	star21 - direction
	planet22 - direction
	star23 - direction
	phenomenon24 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet8)
	(supports instrument1 thermograph4)
	(supports instrument1 image1)
	(calibration_target instrument1 groundstation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 phenomenon6)
	(supports instrument2 image1)
	(calibration_target instrument2 star3)
	(supports instrument3 thermograph4)
	(supports instrument3 infrared5)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 groundstation2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 phenomenon16)
	(supports instrument4 infrared5)
	(calibration_target instrument4 star3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 planet18)
	(supports instrument5 image6)
	(calibration_target instrument5 star3)
	(supports instrument6 infrared5)
	(supports instrument6 image6)
	(calibration_target instrument6 star1)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 planet11)
)
(:goal (and
	(pointing satellite0 planet13)
	(pointing satellite1 groundstation2)
	(pointing satellite4 star3)
	(have_image phenomenon5 thermograph2)
	(have_image phenomenon6 thermograph4)
	(have_image phenomenon6 image6)
	(have_image phenomenon7 infrared5)
	(have_image phenomenon7 thermograph4)
	(have_image planet8 thermograph2)
	(have_image phenomenon10 thermograph4)
	(have_image planet12 thermograph2)
	(have_image planet12 image6)
	(have_image planet13 image1)
	(have_image planet13 image6)
	(have_image phenomenon14 image1)
	(have_image phenomenon15 thermograph4)
	(have_image phenomenon16 image1)
	(have_image phenomenon17 thermograph4)
	(have_image planet18 thermograph4)
	(have_image phenomenon20 image6)
	(have_image star21 image6)
	(have_image star23 image1)
	(have_image phenomenon24 thermograph4)
	(have_image phenomenon24 thermograph2)
))

)

; plan
1. (switch_on instrument5 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument5)
   goals met: 0 of 24
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 24
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 24
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 24
5. (turn_to satellite4 phenomenon20 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 phenomenon20)
   goals met: 0 of 24
6. (turn_to satellite1 groundstation2 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 24
7. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 24
8. (turn_to satellite4 star3 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 star3)
   goals met: 2 of 24
9. (calibrate satellite4 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 2 of 24
10. (turn_to satellite4 phenomenon20 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 phenomenon20)
   goals met: 1 of 24
11. (take_image satellite4 phenomenon20 instrument5 image6)
   added: (have_image phenomenon20 image6)
   goals met: 2 of 24
12. (turn_to satellite4 phenomenon6 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 phenomenon6)
   goals met: 2 of 24
13. (take_image satellite4 phenomenon6 instrument5 image6)
   added: (have_image phenomenon6 image6)
   goals met: 3 of 24
14. (turn_to satellite4 planet12 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet12)
   goals met: 3 of 24
15. (take_image satellite4 planet12 instrument5 image6)
   added: (have_image planet12 image6)
   goals met: 4 of 24
16. (turn_to satellite4 planet13 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet13)
   goals met: 4 of 24
17. (take_image satellite4 planet13 instrument5 image6)
   added: (have_image planet13 image6)
   goals met: 5 of 24
18. (turn_to satellite4 star21 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 star21)
   goals met: 5 of 24
19. (take_image satellite4 star21 instrument5 image6)
   added: (have_image star21 image6)
   goals met: 6 of 24
20. (turn_to satellite4 star3 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 star3)
   goals met: 7 of 24
21. (turn_to satellite1 phenomenon10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon10)
   goals met: 6 of 24
22. (take_image satellite1 phenomenon10 instrument1 thermograph4)
   added: (have_image phenomenon10 thermograph4)
   goals met: 7 of 24
23. (turn_to satellite1 groundstation2 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation2)
   goals met: 8 of 24
24. (turn_to satellite1 phenomenon14 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon14)
   goals met: 7 of 24
25. (take_image satellite1 phenomenon14 instrument1 image1)
   added: (have_image phenomenon14 image1)
   goals met: 8 of 24
26. (turn_to satellite1 groundstation2 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 groundstation2)
   goals met: 9 of 24
27. (turn_to satellite1 phenomenon15 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon15)
   goals met: 8 of 24
28. (take_image satellite1 phenomenon15 instrument1 thermograph4)
   added: (have_image phenomenon15 thermograph4)
   goals met: 9 of 24
29. (turn_to satellite1 groundstation2 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 groundstation2)
   goals met: 10 of 24
30. (turn_to satellite1 phenomenon16 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon16)
   goals met: 9 of 24
31. (take_image satellite1 phenomenon16 instrument1 image1)
   added: (have_image phenomenon16 image1)
   goals met: 10 of 24
32. (turn_to satellite1 groundstation2 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 groundstation2)
   goals met: 11 of 24
33. (turn_to satellite1 phenomenon17 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon17)
   goals met: 10 of 24
34. (take_image satellite1 phenomenon17 instrument1 thermograph4)
   added: (have_image phenomenon17 thermograph4)
   goals met: 11 of 24
35. (turn_to satellite1 groundstation2 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 groundstation2)
   goals met: 12 of 24
36. (turn_to satellite1 phenomenon24 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon24)
   goals met: 11 of 24
37. (take_image satellite1 phenomenon24 instrument1 thermograph4)
   added: (have_image phenomenon24 thermograph4)
   goals met: 12 of 24
38. (turn_to satellite1 groundstation2 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 groundstation2)
   goals met: 13 of 24
39. (turn_to satellite1 phenomenon6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon6)
   goals met: 12 of 24
40. (take_image satellite1 phenomenon6 instrument1 thermograph4)
   added: (have_image phenomenon6 thermograph4)
   goals met: 13 of 24
41. (turn_to satellite1 groundstation2 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation2)
   goals met: 14 of 24
42. (turn_to satellite1 phenomenon7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon7)
   goals met: 13 of 24
43. (take_image satellite1 phenomenon7 instrument1 thermograph4)
   added: (have_image phenomenon7 thermograph4)
   goals met: 14 of 24
44. (turn_to satellite1 groundstation2 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation2)
   goals met: 15 of 24
45. (turn_to satellite1 planet13 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet13)
   goals met: 14 of 24
46. (take_image satellite1 planet13 instrument1 image1)
   added: (have_image planet13 image1)
   goals met: 15 of 24
47. (turn_to satellite1 groundstation2 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 groundstation2)
   goals met: 16 of 24
48. (turn_to satellite1 planet18 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet18)
   goals met: 15 of 24
49. (take_image satellite1 planet18 instrument1 thermograph4)
   added: (have_image planet18 thermograph4)
   goals met: 16 of 24
50. (turn_to satellite1 groundstation2 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 groundstation2)
   goals met: 17 of 24
51. (turn_to satellite1 star23 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star23)
   goals met: 16 of 24
52. (take_image satellite1 star23 instrument1 image1)
   added: (have_image star23 image1)
   goals met: 17 of 24
53. (turn_to satellite1 groundstation2 star23)
   deleted: (pointing satellite1 star23)
   added: (pointing satellite1 groundstation2)
   goals met: 18 of 24
54. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 18 of 24
55. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 18 of 24
56. (turn_to satellite0 phenomenon24 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon24)
   goals met: 18 of 24
57. (take_image satellite0 phenomenon24 instrument0 thermograph2)
   added: (have_image phenomenon24 thermograph2)
   goals met: 19 of 24
58. (turn_to satellite0 phenomenon5 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 phenomenon5)
   goals met: 19 of 24
59. (take_image satellite0 phenomenon5 instrument0 thermograph2)
   added: (have_image phenomenon5 thermograph2)
   goals met: 20 of 24
60. (turn_to satellite0 phenomenon7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon7)
   goals met: 20 of 24
61. (take_image satellite0 phenomenon7 instrument0 infrared5)
   added: (have_image phenomenon7 infrared5)
   goals met: 21 of 24
62. (turn_to satellite0 planet12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet12)
   goals met: 21 of 24
63. (take_image satellite0 planet12 instrument0 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 22 of 24
64. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 23 of 24
65. (turn_to satellite0 planet8 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet8)
   goals met: 22 of 24
66. (take_image satellite0 planet8 instrument0 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 23 of 24
67. (turn_to satellite0 planet13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet13)
   goals met: 24 of 24
